Revit 2026 API

# IFCFile Properties

---

The IFCFile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IFCFile Class

Autodesk.Revit.DB.IFC Namespace